app/controllers/voters_controller.rb

SELECT * FROM `voters` WHERE (`voters`.`id` = 1)
---
  def show
    @voter = Voter.find(params[:id])

INSERT INTO `voters` (`name`, `city`, `created_at`, `zip_code`, `updated_at`, `date_searched`, `street_address`, `phone_number`, `email`) VALUES('Corey Kuwanoe', 'Las Vegas', '2010-05-19 23:00:08', NULL, '2010-05-19 23:00:08', '2010-05-22', '1525 Canyon Ledge Ct', '7027684176', 'eschalon@gmail.com')
---
  def create
    if params[:voter][:month] and params[:voter][:day]
      params[:voter][:date_searched] = '2010-' + params[:voter][:month] + '-' + params[:voter][:day]
    end
    @voter = Voter.new(params[:voter])
    if @voter.save